# OverlappingLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridChainSketchFailures..::..OverlappingLines Property
BuiltInFailures..::..GridChainSketchFailures Class See Also
---
GridChain sketch contains lines which overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OverlappingLines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OverlappingLines As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OverlappingLines {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridChainSketchFailures Class
Autodesk.Revit.DB Namespace